{
  "copyright": "© 2025-{{year}}.",
  "author": "Minhyeok Park.",
  "email": "pmh_only@pmh.codes",
  "personalData": {
    "title": "[1] About personal data collections.",
    "content": "In the event of abuse, misuse, or other activities that adversely affect the operation or integrity of the service, automated systems may process limited technical information, including but not limited to Internet Protocol (IP) addresses and Autonomous System Numbers (ASN), solely for the purpose of detecting, preventing, and mitigating such activities. Such information is processed transiently and is not retained beyond what is necessary for immediate analysis. I reserve the right to impose access restrictions or to block access, in whole or in part, based on the outcome of such processing."
  },
  "legal": {
    "title": "Legal infos & policy",
    "content": "The source code for custom components used by this service (including the indexer, statistics collector, and frontend) is publicly available. Unless explicitly stated otherwise, these components are source-available software and are not free software or open-source software. Configuration files and scripts are free software and are provided under their respective licenses. This service uses third-party software such as nginx, vsftpd, and other open-source components. All such software is copyrighted by their respective authors and distributed under their own licenses. All Arch Linux packages, repositories, and ISO images provided by this mirror are copyrighted works of their respective authors and contributors. I do not claim ownership of any Arch Linux binaries, packages, source code, or ISO images, and they are distributed in accordance with their original licenses. The custom components of this service (excluding configuration files and scripts) may not be used for commercial purposes and may not be used to operate another public mirror. Use for internal or private mirror services is permitted. This service is provided \"as is\" and \"as available\", without warranties of any kind. I do not guarantee availability or uptime and accept no responsibility or liability for downtime, service interruption, or any damages arising from use of this service. By using this service or any of its software components, you acknowledge that you have read, understood, and agree to this notice and its terms."
  }
}
